_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_8 (Embedding)      (None, 40, 100)           100000    
_________________________________________________________________
lstm_15 (LSTM)               (None, 40, 256)           365568    
_________________________________________________________________
lstm_16 (LSTM)               (None, 256)               525312    
_________________________________________________________________
dense_9 (Dense)              (None, 1000)              257000    
=================================================================
Total params: 1,247,880
Trainable params: 1,247,880
Non-trainable params: 0
_________________________________________________________________
