_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_4 (Embedding)      (None, 40, 100)           10000     
_________________________________________________________________
lstm_7 (LSTM)                (None, 40, 256)           365568    
_________________________________________________________________
lstm_8 (LSTM)                (None, 256)               525312    
_________________________________________________________________
dense_5 (Dense)              (None, 100)               25700     
=================================================================
Total params: 926,580
Trainable params: 926,580
Non-trainable params: 0
